/* * Версія 5.0
 * Лабораторна робота №3 з курсу "Об'єктно-орієнтоване програмування 1"
 * Виконав: Агапов Олександр | Група: ІПЗ-11(1) | Варіант: 1
 * * ЕТАПИ ЗАВДАННЯ:
 * 1. Клас Teacher: зберігання інформації про викладача та зміна його навантаження.
 * 2. Клас Student: зберігання даних студента, додавання оцінок, розрахунок рейтингу.
 * 3. Клас Service: реалізація вводу/виводу даних на консоль та роботи з файлами (робота через екземпляри об'єктів).
 * 4. Вкладений клас DiplomaProject (Версія 2): вибір теми з текстового файлу, обчислення складності
 * алгоритмів та автоматичне виставлення оцінки.
 * 5. Часткові класи (Версія 3): використання модифікатора partial для розділення
 * класу Student та його вкладеного класу на кілька фізичних файлів.
 * 6. Клас ScientificPaper (Версія 4): бінарний пошук ідентифікатора джерела.
 * * ОСНОВНІ ВИМОГИ:
 * - Інкапсуляція даних (приватні поля + публічні властивості).
 * - Наявність конструкторів (за замовчуванням, з параметрами, копіювання).
 * - Перевірка вводу (захист від некоректних даних користувача).
 * - Дотримання принципу єдиної відповідальності (SRP).
 */
using System;

namespace lab3agapov
{

    class Program
    {
        static void Main(string[] args)
        {
            Console.Clear();
            Service service = new Service();
            service.WelcomeInfo();

            Teacher myTeacher = new Teacher();
            Student myStudent = new Student();
            List<Student> students = new List<Student>();

            Menu menu = new Menu(service, myTeacher, myStudent, students);
            menu.Run();
        }
    }
}